YuZane/ExpressTrain/Device/MM32F5330/Include/reg_gpio.h
#define GPIO_CRL_CNF7_Pos                (30)
#define GPIO_CRL_CNF7_Msk                (0x03U << GPIO_CRL_CNF7_Pos)   /*!< CNF7[1:0] bits (portx configuration bits, pin 7) */
#define GPIO_CRL_CNF7_0                  (0x01U << GPIO_CRL_CNF7_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF7_1                  (0x02U << GPIO_CRL_CNF7_Pos)   /*!< Bit 1 */

/**
  * @brief GPIO_CRH Register Bit Definition
  */
#define GPIO_CRH_MODE                    ((uint32_t)0x33333333)         /*!< Port x mode bits */

#define GPIO_CRH_MODE8_Pos               (0)
#define GPIO_CRH_MODE8_Msk               (0x03U << GPIO_CRH_MODE8_Pos)  /*!< MODE8[1:0] bits (portx mode bits, pin 0) */
#define GPIO_CRH_MODE8_0                 (0x01U << GPIO_CRH_MODE8_Pos)  /*!< Bit 0 */
#define GPIO_CRH_MODE8_1                 (0x02U << GPIO_CRH_MODE8_Pos)  /*!< Bit 1 */
#define GPIO_CRH_CNF8_Pos                (2)
#define GPIO_CRH_CNF8_Msk                (0x03U << GPIO_CRH_CNF8_Pos)   /*!< CNF8[1:0] bits (portx configuration bits, pin 0) */
#define GPIO_CRH_CNF8_0                  (0x01U << GPIO_CRH_CNF8_Pos)   /*!< Bit 0 */
#define GPIO_CRH_CNF8_1                  (0x02U << GPIO_CRH_CNF8_Pos)   /*!< Bit 1 */
#define GPIO_CRH_MODE9_Pos               (4)
#define GPIO_CRH_MODE9_Msk               (0x03U << GPIO_CRH_MODE9_Pos)  /*!< MODE9[1:0] bits (portx mode bits, pin 1) */
#define GPIO_CRH_MODE9_0                 (0x01U << GPIO_CRH_MODE9_Pos)  /*!< Bit 0 */
#define GPIO_CRH_MODE9_1                 (0x02U << GPIO_CRH_MODE9_Pos)  /*!< Bit 1 */
#define GPIO_CRH_CNF9_Pos                (6)
#define GPIO_CRH_CNF9_Msk                (0x03U << GPIO_CRH_CNF9_Pos)   /*!< CNF9[1:0] bits (portx configuration bits, pin 1) */
#define GPIO_CRH_CNF9_0                  (0x01U << GPIO_CRH_CNF9_Pos)   /*!< Bit 0 */
#define GPIO_CRH_CNF9_1                  (0x02U << GPIO_CRH_CNF9_Pos)   /*!< Bit 1 */
#define GPIO_CRH_MODE10_Pos              (8)
#define GPIO_CRH_MODE10_Msk              (0x03U << GPIO_CRH_MODE10_Pos) /*!< MODE10[1:0] bits (portx mode bits, pin 2) */
#define GPIO_CRH_MODE10_0                (0x01U << GPIO_CRH_MODE10_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE10_1                (0x02U << GPIO_CRH_MODE10_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF10_Pos               (10)
#define GPIO_CRH_CNF10_Msk               (0x03U << GPIO_CRH_CNF10_Pos)  /*!< CNF10[1:0] bits (portx configuration bits, pin 2) */
#define GPIO_CRH_CNF10_0                 (0x01U << GPIO_CRH_CNF10_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF10_1                 (0x02U << GPIO_CRH_CNF10_Pos)  /*!< Bit 1 */
#define GPIO_CRH_MODE11_Pos              (12)
#define GPIO_CRH_MODE11_Msk              (0x03U << GPIO_CRH_MODE11_Pos) /*!< MODE11[1:0] bits (portx mode bits, pin 3) */
#define GPIO_CRH_MODE11_0                (0x01U << GPIO_CRH_MODE11_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE11_1                (0x02U << GPIO_CRH_MODE11_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF11_Pos               (14)
#define GPIO_CRH_CNF11_Msk               (0x03U << GPIO_CRH_CNF11_Pos)  /*!< CNF11[1:0] bits (portx configuration bits, pin 3) */
#define GPIO_CRH_CNF11_0                 (0x01U << GPIO_CRH_CNF11_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF11_1                 (0x02U << GPIO_CRH_CNF11_Pos)  /*!< Bit 1 */
#define GPIO_CRH_MODE12_Pos              (16)
#define GPIO_CRH_MODE12_Msk              (0x03U << GPIO_CRH_MODE12_Pos) /*!< MODE12[1:0] bits (portx mode bits, pin 4) */
#define GPIO_CRH_MODE12_0                (0x01U << GPIO_CRH_MODE12_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE12_1                (0x02U << GPIO_CRH_MODE12_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF12_Pos               (18)
#define GPIO_CRH_CNF12_Msk               (0x03U << GPIO_CRH_CNF12_Pos)  /*!< CNF12[1:0] bits (portx configuration bits, pin 4) */
#define GPIO_CRH_CNF12_0                 (0x01U << GPIO_CRH_CNF12_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF12_1                 (0x02U << GPIO_CRH_CNF12_Pos)  /*!< Bit 1 */
#define GPIO_CRH_MODE13_Pos              (20)
#define GPIO_CRH_MODE13_Msk              (0x03U << GPIO_CRH_MODE13_Pos) /*!< MODE13[1:0] bits (portx mode bits, pin 5) */
#define GPIO_CRH_MODE13_0                (0x01U << GPIO_CRH_MODE13_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE13_1                (0x02U << GPIO_CRH_MODE13_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF13_Pos               (22)
#define GPIO_CRH_CNF13_Msk               (0x03U << GPIO_CRH_CNF13_Pos)  /*!< CNF13[1:0] bits (portx configuration bits, pin 5) */
#define GPIO_CRH_CNF13_0                 (0x01U << GPIO_CRH_CNF13_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF13_1                 (0x02U << GPIO_CRH_CNF13_Pos)  /*!< Bit 1 */
#define GPIO_CRH_MODE14_Pos              (24)
#define GPIO_CRH_MODE14_Msk              (0x03U << GPIO_CRH_MODE14_Pos) /*!< MODE14[1:0] bits (portx mode bits, pin 6) */
#define GPIO_CRH_MODE14_0                (0x01U << GPIO_CRH_MODE14_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE14_1                (0x02U << GPIO_CRH_MODE14_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF14_Pos               (26)
#define GPIO_CRH_CNF14_Msk               (0x03U << GPIO_CRH_CNF14_Pos)  /*!< CNF14[1:0] bits (portx configuration bits, pin 6) */
#define GPIO_CRH_CNF14_0                 (0x01U << GPIO_CRH_CNF14_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF14_1                 (0x02U << GPIO_CRH_CNF14_Pos)  /*!< Bit 1 */
#define GPIO_CRH_MODE15_Pos              (28)
#define GPIO_CRH_MODE15_Msk              (0x03U << GPIO_CRH_MODE15_Pos) /*!< MODE15[1:0] bits (portx mode bits, pin 7) */
#define GPIO_CRH_MODE15_0                (0x01U << GPIO_CRH_MODE15_Pos) /*!< Bit 0 */
#define GPIO_CRH_MODE15_1                (0x02U << GPIO_CRH_MODE15_Pos) /*!< Bit 1 */
#define GPIO_CRH_CNF15_Pos               (30)
#define GPIO_CRH_CNF15_Msk               (0x03U << GPIO_CRH_CNF15_Pos)  /*!< CNF15[1:0] bits (portx configuration bits, pin 7) */
#define GPIO_CRH_CNF15_0                 (0x01U << GPIO_CRH_CNF15_Pos)  /*!< Bit 0 */
#define GPIO_CRH_CNF15_1                 (0x02U << GPIO_CRH_CNF15_Pos)  /*!< Bit 1 */

/**
  * @brief GPIO_IDR Register Bit Definition
  */
#define GPIO_IDR_DATA_Pos                (0)
#define GPIO_IDR_DATA_Msk                (0xFFFFU << GPIO_IDR_DATA_Pos) /*!< Port input data */

/**
  * @brief GPIO_IDR Register Bit Definition
  */
#define GPIO_IDR_IDR0_Pos                (0)
#define GPIO_IDR_IDR0_Msk                (0x01U << GPIO_IDR_IDR0_Pos)  /*!< Portx Set bit 0 */
#define GPIO_IDR_IDR1_Pos                (1)
#define GPIO_IDR_IDR1_Msk                (0x01U << GPIO_IDR_IDR1_Pos)  /*!< Portx Set bit 1 */
#define GPIO_IDR_IDR2_Pos                (2)
#define GPIO_IDR_IDR2_Msk                (0x01U << GPIO_IDR_IDR2_Pos)  /*!< Portx Set bit 2 */
#define GPIO_IDR_IDR3_Pos                (3)
#define GPIO_IDR_IDR3_Msk                (0x01U << GPIO_IDR_IDR3_Pos)  /*!< Portx Set bit 3 */
#define GPIO_IDR_IDR4_Pos                (4)
#define GPIO_IDR_IDR4_Msk                (0x01U << GPIO_IDR_IDR4_Pos)  /*!< Portx Set bit 4 */
#define GPIO_IDR_IDR5_Pos                (5)
#define GPIO_IDR_IDR5_Msk                (0x01U << GPIO_IDR_IDR5_Pos)  /*!< Portx Set bit 5 */
#define GPIO_IDR_IDR6_Pos                (6)
#define GPIO_IDR_IDR6_Msk                (0x01U << GPIO_IDR_IDR6_Pos)  /*!< Portx Set bit 6 */
#define GPIO_IDR_IDR7_Pos                (7)
#define GPIO_IDR_IDR7_Msk                (0x01U << GPIO_IDR_IDR7_Pos)  /*!< Portx Set bit 7 */
#define GPIO_IDR_IDR8_Pos                (8)
#define GPIO_IDR_IDR8_Msk                (0x01U << GPIO_IDR_IDR8_Pos)  /*!< Portx Set bit 8 */
#define GPIO_IDR_IDR9_Pos                (9)
#define GPIO_IDR_IDR9_Msk                (0x01U << GPIO_IDR_IDR9_Pos)  /*!< Portx Set bit 9 */
#define GPIO_IDR_IDR10_Pos               (10)
#define GPIO_IDR_IDR10_Msk               (0x01U << GPIO_IDR_IDR10_Pos) /*!< Portx Set bit 10 */
#define GPIO_IDR_IDR11_Pos               (11)
#define GPIO_IDR_IDR11_Msk               (0x01U << GPIO_IDR_IDR11_Pos) /*!< Portx Set bit 11 */
#define GPIO_IDR_IDR12_Pos               (12)
#define GPIO_IDR_IDR12_Msk               (0x01U << GPIO_IDR_IDR12_Pos) /*!< Portx Set bit 12 */
#define GPIO_IDR_IDR13_Pos               (13)
#define GPIO_IDR_IDR13_Msk               (0x01U << GPIO_IDR_IDR13_Pos) /*!< Portx Set bit 13 */
#define GPIO_IDR_IDR14_Pos               (14)
#define GPIO_IDR_IDR14_Msk               (0x01U << GPIO_IDR_IDR14_Pos) /*!< Portx Set bit 14 */
#define GPIO_IDR_IDR15_Pos               (15)
#define GPIO_IDR_IDR15_Msk               (0x01U << GPIO_IDR_IDR15_Pos) /*!< Portx Set bit 15 */

/**
  * @brief GPIO_ODR Register Bit Definition
  */
#define GPIO_ODR_DATA_Pos                (0)
#define GPIO_ODR_DATA_Msk                (0xFFFF << GPIO_ODR_DATA_Pos) /*!< Port output data */

/**
  * @brief GPIO_ODR Register Bit Definition
  */
#define GPIO_ODR_ODR0_Pos                (0)
#define GPIO_ODR_ODR0_Msk                (0x01U << GPIO_ODR_ODR0_Pos)  /*!< Portx Set bit 0 */
#define GPIO_ODR_ODR1_Pos                (1)
#define GPIO_ODR_ODR1_Msk                (0x01U << GPIO_ODR_ODR1_Pos)  /*!< Portx Set bit 1 */
#define GPIO_ODR_ODR2_Pos                (2)
#define GPIO_ODR_ODR2_Msk                (0x01U << GPIO_ODR_ODR2_Pos)  /*!< Portx Set bit 2 */
#define GPIO_ODR_ODR3_Pos                (3)
#define GPIO_ODR_ODR3_Msk                (0x01U << GPIO_ODR_ODR3_Pos)  /*!< Portx Set bit 3 */
#define GPIO_ODR_ODR4_Pos                (4)
#define GPIO_ODR_ODR4_Msk                (0x01U << GPIO_ODR_ODR4_Pos)  /*!< Portx Set bit 4 */
#define GPIO_ODR_ODR5_Pos                (5)
#define GPIO_ODR_ODR5_Msk                (0x01U << GPIO_ODR_ODR5_Pos)  /*!< Portx Set bit 5 */
#define GPIO_ODR_ODR6_Pos                (6)
#define GPIO_ODR_ODR6_Msk                (0x01U << GPIO_ODR_ODR6_Pos)  /*!< Portx Set bit 6 */
#define GPIO_ODR_ODR7_Pos                (7)
#define GPIO_ODR_ODR7_Msk                (0x01U << GPIO_ODR_ODR7_Pos)  /*!< Portx Set bit 7 */
#define GPIO_ODR_ODR8_Pos                (8)
#define GPIO_ODR_ODR8_Msk                (0x01U << GPIO_ODR_ODR8_Pos)  /*!< Portx Set bit 8 */
#define GPIO_ODR_ODR9_Pos                (9)
#define GPIO_ODR_ODR9_Msk                (0x01U << GPIO_ODR_ODR9_Pos)  /*!< Portx Set bit 9 */
#define GPIO_ODR_ODR10_Pos               (10)
#define GPIO_ODR_ODR10_Msk               (0x01U << GPIO_ODR_ODR10_Pos) /*!< Portx Set bit 10 */
#define GPIO_ODR_ODR11_Pos               (11)
#define GPIO_ODR_ODR11_Msk               (0x01U << GPIO_ODR_ODR11_Pos) /*!< Portx Set bit 11 */
#define GPIO_ODR_ODR12_Pos               (12)
#define GPIO_ODR_ODR12_Msk               (0x01U << GPIO_ODR_ODR12_Pos) /*!< Portx Set bit 12 */
#define GPIO_ODR_ODR13_Pos               (13)
#define GPIO_ODR_ODR13_Msk               (0x01U << GPIO_ODR_ODR13_Pos) /*!< Portx Set bit 13 */
#define GPIO_ODR_ODR14_Pos               (14)
#define GPIO_ODR_ODR14_Msk               (0x01U << GPIO_ODR_ODR14_Pos) /*!< Portx Set bit 14 */
#define GPIO_ODR_ODR15_Pos               (15)
#define GPIO_ODR_ODR15_Msk               (0x01U << GPIO_ODR_ODR15_Pos) /*!< Portx Set bit 15 */

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BSRR_BS_Pos                 (0)
#define GPIO_BSRR_BS_Msk                 (0xFFFFU << GPIO_BSRR_BS_Pos) /*!< Portx Reset */

/**
  * @brief GPIO_BSRR Register Bit Definition
  */
#define GPIO_BSRR_BS0_Pos                (0)
#define GPIO_BSRR_BS0_Msk                (0x01U << GPIO_BSRR_BS0_Pos)  /*!< Portx Set bit 0 */
#define GPIO_BSRR_BS1_Pos                (1)
#define GPIO_BSRR_BS1_Msk                (0x01U << GPIO_BSRR_BS1_Pos)  /*!< Portx Set bit 1 */
#define GPIO_BSRR_BS2_Pos                (2)
#define GPIO_BSRR_BS2_Msk                (0x01U << GPIO_BSRR_BS2_Pos)  /*!< Portx Set bit 2 */
#define GPIO_BSRR_BS3_Pos                (3)
#define GPIO_BSRR_BS3_Msk                (0x01U << GPIO_BSRR_BS3_Pos)  /*!< Portx Set bit 3 */
#define GPIO_BSRR_BS4_Pos                (4)
#define GPIO_BSRR_BS4_Msk                (0x01U << GPIO_BSRR_BS4_Pos)  /*!< Portx Set bit 4 */
#define GPIO_BSRR_BS5_Pos                (5)
#define GPIO_BSRR_BS5_Msk                (0x01U << GPIO_BSRR_BS5_Pos)  /*!< Portx Set bit 5 */
#define GPIO_BSRR_BS6_Pos                (6)
#define GPIO_BSRR_BS6_Msk                (0x01U << GPIO_BSRR_BS6_Pos)  /*!< Portx Set bit 6 */
#define GPIO_BSRR_BS7_Pos                (7)
#define GPIO_BSRR_BS7_Msk                (0x01U << GPIO_BSRR_BS7_Pos)  /*!< Portx Set bit 7 */
#define GPIO_BSRR_BS8_Pos                (8)
#define GPIO_BSRR_BS8_Msk                (0x01U << GPIO_BSRR_BS8_Pos)  /*!< Portx Set bit 8 */
#define GPIO_BSRR_BS9_Pos                (9)
#define GPIO_BSRR_BS9_Msk                (0x01U << GPIO_BSRR_BS9_Pos)  /*!< Portx Set bit 9 */
#define GPIO_BSRR_BS10_Pos               (10)
#define GPIO_BSRR_BS10_Msk               (0x01U << GPIO_BSRR_BS10_Pos) /*!< Portx Set bit 10 */
#define GPIO_BSRR_BS11_Pos               (11)
#define GPIO_BSRR_BS11_Msk               (0x01U << GPIO_BSRR_BS11_Pos) /*!< Portx Set bit 11 */
#define GPIO_BSRR_BS12_Pos               (12)
#define GPIO_BSRR_BS12_Msk               (0x01U << GPIO_BSRR_BS12_Pos) /*!< Portx Set bit 12 */
#define GPIO_BSRR_BS13_Pos               (13)
#define GPIO_BSRR_BS13_Msk               (0x01U << GPIO_BSRR_BS13_Pos) /*!< Portx Set bit 13 */
#define GPIO_BSRR_BS14_Pos               (14)
#define GPIO_BSRR_BS14_Msk               (0x01U << GPIO_BSRR_BS14_Pos) /*!< Portx Set bit 14 */
#define GPIO_BSRR_BS15_Pos               (15)
#define GPIO_BSRR_BS15_Msk               (0x01U << GPIO_BSRR_BS15_Pos) /*!< Portx Set bit 15 */

#define GPIO_BSRR_BR0_Pos                (16)
#define GPIO_BSRR_BR0_Msk                (0x01U << GPIO_BSRR_BR0_Pos)  /*!< Portx Reset bit 0 */
#define GPIO_BSRR_BR1_Pos                (17)
#define GPIO_BSRR_BR1_Msk                (0x01U << GPIO_BSRR_BR1_Pos)  /*!< Portx Reset bit 1 */
#define GPIO_BSRR_BR2_Pos                (18)
#define GPIO_BSRR_BR2_Msk                (0x01U << GPIO_BSRR_BR2_Pos)  /*!< Portx Reset bit 2 */
#define GPIO_BSRR_BR3_Pos                (19)
#define GPIO_BSRR_BR3_Msk                (0x01U << GPIO_BSRR_BR3_Pos)  /*!< Portx Reset bit 3 */
#define GPIO_BSRR_BR4_Pos                (20)
#define GPIO_BSRR_BR4_Msk                (0x01U << GPIO_BSRR_BR4_Pos)  /*!< Portx Reset bit 4 */
#define GPIO_BSRR_BR5_Pos                (21)
#define GPIO_BSRR_BR5_Msk                (0x01U << GPIO_BSRR_BR5_Pos)  /*!< Portx Reset bit 5 */
#define GPIO_BSRR_BR6_Pos                (22)
#define GPIO_BSRR_BR6_Msk                (0x01U << GPIO_BSRR_BR6_Pos)  /*!< Portx Reset bit 6 */
#define GPIO_BSRR_BR7_Pos                (23)
#define GPIO_BSRR_BR7_Msk                (0x01U << GPIO_BSRR_BR7_Pos)  /*!< Portx Reset bit 7 */
#define GPIO_BSRR_BR8_Pos                (24)
#define GPIO_BSRR_BR8_Msk                (0x01U << GPIO_BSRR_BR8_Pos)  /*!< Portx Reset bit 8 */
#define GPIO_BSRR_BR9_Pos                (25)
#define GPIO_BSRR_BR9_Msk                (0x01U << GPIO_BSRR_BR9_Pos)  /*!< Portx Reset bit 9 */
#define GPIO_BSRR_BR10_Pos               (26)
#define GPIO_BSRR_BR10_Msk               (0x01U << GPIO_BSRR_BR10_Pos) /*!< Portx Reset bit 10 */
#define GPIO_BSRR_BR11_Pos               (27)
#define GPIO_BSRR_BR11_Msk               (0x01U << GPIO_BSRR_BR11_Pos) /*!< Portx Reset bit 11 */
#define GPIO_BSRR_BR12_Pos               (28)
#define GPIO_BSRR_BR12_Msk               (0x01U << GPIO_BSRR_BR12_Pos) /*!< Portx Reset bit 12 */
#define GPIO_BSRR_BR13_Pos               (29)
#define GPIO_BSRR_BR13_Msk               (0x01U << GPIO_BSRR_BR13_Pos) /*!< Portx Reset bit 13 */
#define GPIO_BSRR_BR14_Pos               (30)
#define GPIO_BSRR_BR14_Msk               (0x01U << GPIO_BSRR_BR14_Pos) /*!< Portx Reset bit 14 */
#define GPIO_BSRR_BR15_Pos               (31)
#define GPIO_BSRR_BR15_Msk               (0x01U << GPIO_BSRR_BR15_Pos) /*!< Portx Reset bit 15 */

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BRR_BR_Pos                  (0)
#define GPIO_BRR_BR_Msk                  (0xFFFFU << GPIO_BRR_BR_Pos) /*!< Portx Reset */

/**
  * @brief GPIO_BRR Register Bit Definition
  */
#define GPIO_BRR_BR0_Pos                 (0)
#define GPIO_BRR_BR0_Msk                 (0x01U << GPIO_BRR_BR0_Pos)  /*!< Portx Set bit 0 */
#define GPIO_BRR_BR1_Pos                 (1)
#define GPIO_BRR_BR1_Msk                 (0x01U << GPIO_BRR_BR1_Pos)  /*!< Portx Set bit 1 */
#define GPIO_BRR_BR2_Pos                 (2)
#define GPIO_BRR_BR2_Msk                 (0x01U << GPIO_BRR_BR2_Pos)  /*!< Portx Set bit 2 */
#define GPIO_BRR_BR3_Pos                 (3)
#define GPIO_BRR_BR3_Msk                 (0x01U << GPIO_BRR_BR3_Pos)  /*!< Portx Set bit 3 */
#define GPIO_BRR_BR4_Pos                 (4)
#define GPIO_BRR_BR4_Msk                 (0x01U << GPIO_BRR_BR4_Pos)  /*!< Portx Set bit 4 */
#define GPIO_BRR_BR5_Pos                 (5)
#define GPIO_BRR_BR5_Msk                 (0x01U << GPIO_BRR_BR5_Pos)  /*!< Portx Set bit 5 */
#define GPIO_BRR_BR6_Pos                 (6)
#define GPIO_BRR_BR6_Msk                 (0x01U << GPIO_BRR_BR6_Pos)  /*!< Portx Set bit 6 */
#define GPIO_BRR_BR7_Pos                 (7)
#define GPIO_BRR_BR7_Msk                 (0x01U << GPIO_BRR_BR7_Pos)  /*!< Portx Set bit 7 */
#define GPIO_BRR_BR8_Pos                 (8)
#define GPIO_BRR_BR8_Msk                 (0x01U << GPIO_BRR_BR8_Pos)  /*!< Portx Set bit 8 */
#define GPIO_BRR_BR9_Pos                 (9)
#define GPIO_BRR_BR9_Msk                 (0x01U << GPIO_BRR_BR9_Pos)  /*!< Portx Set bit 9 */
#define GPIO_BRR_BR10_Pos                (10)
#define GPIO_BRR_BR10_Msk                (0x01U << GPIO_BRR_BR10_Pos) /*!< Portx Set bit 10 */
#define GPIO_BRR_BR11_Pos                (11)
#define GPIO_BRR_BR11_Msk                (0x01U << GPIO_BRR_BR11_Pos) /*!< Portx Set bit 11 */
#define GPIO_BRR_BR12_Pos                (12)
#define GPIO_BRR_BR12_Msk                (0x01U << GPIO_BRR_BR12_Pos) /*!< Portx Set bit 12 */
#define GPIO_BRR_BR13_Pos                (13)
#define GPIO_BRR_BR13_Msk                (0x01U << GPIO_BRR_BR13_Pos) /*!< Portx Set bit 13 */
#define GPIO_BRR_BR14_Pos                (14)
#define GPIO_BRR_BR14_Msk                (0x01U << GPIO_BRR_BR14_Pos) /*!< Portx Set bit 14 */
#define GPIO_BRR_BR15_Pos                (15)
#define GPIO_BRR_BR15_Msk                (0x01U << GPIO_BRR_BR15_Pos) /*!< Portx Set bit 15 */

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define GPIO_LCKR_LCK_Pos                (0)
#define GPIO_LCKR_LCK_Msk                (0xFFFFU << GPIO_LCKR_LCK_Pos) /*!< Portx Lock */
#define GPIO_LCKR_LCKK_Pos               (16)
#define GPIO_LCKR_LCKK_Msk               (0x01U << GPIO_LCKR_LCKK_Pos)  /*!< Lock key */

/**
  * @brief GPIO_LCKR Register Bit Definition
  */
#define GPIO_LCKR_LCK0_Pos               (0)
#define GPIO_LCKR_LCK0_Msk               (0x01U << GPIO_LCKR_LCK0_Pos)  /*!< Portx Set bit 0 */
#define GPIO_LCKR_LCK1_Pos               (1)
#define GPIO_LCKR_LCK1_Msk               (0x01U << GPIO_LCKR_LCK1_Pos)  /*!< Portx Set bit 1 */
#define GPIO_LCKR_LCK2_Pos               (2)
#define GPIO_LCKR_LCK2_Msk               (0x01U << GPIO_LCKR_LCK2_Pos)  /*!< Portx Set bit 2 */
#define GPIO_LCKR_LCK3_Pos               (3)
#define GPIO_LCKR_LCK3_Msk               (0x01U << GPIO_LCKR_LCK3_Pos)  /*!< Portx Set bit 3 */
#define GPIO_LCKR_LCK4_Pos               (4)
#define GPIO_LCKR_LCK4_Msk               (0x01U << GPIO_LCKR_LCK4_Pos)  /*!< Portx Set bit 4 */
#define GPIO_LCKR_LCK5_Pos               (5)
#define GPIO_LCKR_LCK5_Msk               (0x01U << GPIO_LCKR_LCK5_Pos)  /*!< Portx Set bit 5 */
#define GPIO_LCKR_LCK6_Pos               (6)
#define GPIO_LCKR_LCK6_Msk               (0x01U << GPIO_LCKR_LCK6_Pos)  /*!< Portx Set bit 6 */
#define GPIO_LCKR_LCK7_Pos               (7)
#define GPIO_LCKR_LCK7_Msk               (0x01U << GPIO_LCKR_LCK7_Pos)  /*!< Portx Set bit 7 */
#define GPIO_LCKR_LCK8_Pos               (8)
#define GPIO_LCKR_LCK8_Msk               (0x01U << GPIO_LCKR_LCK8_Pos)  /*!< Portx Set bit 8 */
#define GPIO_LCKR_LCK9_Pos               (9)
#define GPIO_LCKR_LCK9_Msk               (0x01U << GPIO_LCKR_LCK9_Pos)  /*!< Portx Set bit 9 */
#define GPIO_LCKR_LCK10_Pos              (10)
#define GPIO_LCKR_LCK10_Msk              (0x01U << GPIO_LCKR_LCK10_Pos) /*!< Portx Set bit 10 */
#define GPIO_LCKR_LCK11_Pos              (11)
#define GPIO_LCKR_LCK11_Msk              (0x01U << GPIO_LCKR_LCK11_Pos) /*!< Portx Set bit 11 */
#define GPIO_LCKR_LCK12_Pos              (12)
#define GPIO_LCKR_LCK12_Msk              (0x01U << GPIO_LCKR_LCK12_Pos) /*!< Portx Set bit 12 */
#define GPIO_LCKR_LCK13_Pos              (13)
#define GPIO_LCKR_LCK13_Msk              (0x01U << GPIO_LCKR_LCK13_Pos) /*!< Portx Set bit 13 */
#define GPIO_LCKR_LCK14_Pos              (14)
#define GPIO_LCKR_LCK14_Msk              (0x01U << GPIO_LCKR_LCK14_Pos) /*!< Portx Set bit 14 */
#define GPIO_LCKR_LCK15_Pos              (15)
#define GPIO_LCKR_LCK15_Msk              (0x01U << GPIO_LCKR_LCK15_Pos) /*!< Portx Set bit 15 */

/**
  * @brief GPIO_DCR Register Bit Definition
  */
#define GPIO_DCR_PX0_Pos                 (0)
#define GPIO_DCR_PX0_Msk                 (0x03U << GPIO_DCR_PX0_Pos)  /*!< PX0[1:0] bits (pinx configuration bits, pin 0) */
#define GPIO_DCR_PX0_MODE0               (0x00U << GPIO_DCR_PX0_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX0_MODE1               (0x01U << GPIO_DCR_PX0_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX0_MODE2               (0x02U << GPIO_DCR_PX0_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX0_MODE3               (0x03U << GPIO_DCR_PX0_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX1_Pos                 (2)
#define GPIO_DCR_PX1_Msk                 (0x03U << GPIO_DCR_PX1_Pos)  /*!< PX1[1:0] bits (pinx configuration bits, pin 1) */
#define GPIO_DCR_PX1_MODE0               (0x00U << GPIO_DCR_PX1_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX1_MODE1               (0x01U << GPIO_DCR_PX1_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX1_MODE2               (0x02U << GPIO_DCR_PX1_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX1_MODE3               (0x03U << GPIO_DCR_PX1_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX2_Pos                 (4)
#define GPIO_DCR_PX2_Msk                 (0x03U << GPIO_DCR_PX2_Pos)  /*!< PX2[1:0] bits (pinx configuration bits, pin 2) */
#define GPIO_DCR_PX2_MODE0               (0x00U << GPIO_DCR_PX2_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX2_MODE1               (0x01U << GPIO_DCR_PX2_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX2_MODE2               (0x02U << GPIO_DCR_PX2_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX2_MODE3               (0x03U << GPIO_DCR_PX2_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX3_Pos                 (6)
#define GPIO_DCR_PX3_Msk                 (0x03U << GPIO_DCR_PX3_Pos)  /*!< PX3[1:0] bits (pinx configuration bits, pin 3) */
#define GPIO_DCR_PX3_MODE0               (0x00U << GPIO_DCR_PX3_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX3_MODE1               (0x01U << GPIO_DCR_PX3_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX3_MODE2               (0x02U << GPIO_DCR_PX3_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX3_MODE3               (0x03U << GPIO_DCR_PX3_Pos)  /*!< Mode = 3 */

#define GPIO_DCR_PX4_Pos                 (8)
#define GPIO_DCR_PX4_Msk                 (0x03U << GPIO_DCR_PX4_Pos)  /*!< PX4[1:0] bits (pinx configuration bits, pin 4) */
#define GPIO_DCR_PX4_MODE0               (0x00U << GPIO_DCR_PX4_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX4_MODE1               (0x01U << GPIO_DCR_PX4_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX4_MODE2               (0x02U << GPIO_DCR_PX4_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX4_MODE3               (0x03U << GPIO_DCR_PX4_Pos)  /*!< Mode = 3 */

